eisup_2019_docmng_integration/src/Documents/абс_ОтражениеКосвенныхЗатратПоПроектам/абс_ОтражениеКосвенныхЗатратПоПроектам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ОтражениеКосвенныхЗатратПоПроектам</name>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.ОборотыБюджетов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПравилаЗакрытия</name>
    <attributes>
      <name>Правило</name>
      <type>
        <types>CatalogRef.абс_ПравилаЗакрытияСчетов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/AccumulationRegisters/ОборотыБюджетов/ОборотыБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОборотыБюджетов</name>
  <comment>(Упр)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСценария</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяОборотов</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТипКонтрагента</name>
    <type>
      <types>CatalogRef.абс_ТипыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТипСети</name>
    <type>
      <types>CatalogRef.абс_ТипыСетей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_КВ</name>
    <type>
      <types>CatalogRef.абс_КапитальныеВложения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТипРасхода</name>
    <type>
      <types>CatalogRef.абс_ТипыРасходовНаПроизводствоИРеализацию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_СчетБУ</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ttk_ОбъектБюджетирования</name>
    <type>
      <types>CatalogRef.ttk_ОбъектыБюджетирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ttk_Город</name>
    <type>
      <types>CatalogRef.ttk_Города</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/Catalogs/абс_ПравилаЗакрытияСчетов/абс_ПравилаЗакрытияСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_ПравилаЗакрытияСчетов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Счет</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
      <types>ChartOfAccountsRef.Международный</types>
      <types>ChartOfAccountsRef.Налоговый</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаБаза</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МодульПолученияТаблицыДвижений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьТаблицуПоМодулю</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИспользуетсяДЗО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПроектныйУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Архив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыЗапроса</name>
    <attributes>
      <name>НазваниеПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыЗапросаБаза</name>
    <attributes>
      <name>НазваниеПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>абс_ИсторияИзменения</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Владелец</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Разработчик</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтарыйТекстЗапроса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтарыйТекстЗапросаБаза</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтраныйМодульПолученияТаблицыДвижений</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Documents/абс_ОтражениеКосвенныхЗатратПоПроектам/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка корректности выбранных правил закрытия
	// Они должны быть с признаком "Проектный учет" и счет = 25, 26, 44
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_ОтражениеКосвенныхЗатратПоПроектамПравилаЗакрытия.Правило,
	|	абс_ОтражениеКосвенныхЗатратПоПроектамПравилаЗакрытия.НомерСтроки
	|ИЗ
	|	Документ.абс_ОтражениеКосвенныхЗатратПоПроектам.ПравилаЗакрытия КАК абс_ОтражениеКосвенныхЗатратПоПроектамПравилаЗакрытия
	|ГДЕ
	|	абс_ОтражениеКосвенныхЗатратПоПроектамПравилаЗакрытия.Ссылка = &Ссылка
	|	И (НЕ абс_ОтражениеКосвенныхЗатратПоПроектамПравилаЗакрытия.Правило.Счет В ИЕРАРХИИ (&СписокСчетов)
	|			ИЛИ НЕ абс_ОтражениеКосвенныхЗатратПоПроектамПравилаЗакрытия.Правило.абс_ПроектныйУчет)";
	
	СписокСчетов = Новый СписокЗначений;
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасходыНаПродажу);
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Сообщить("В документе в табличной части ""Правила закрытия"" используются некорректные правила:" + Символы.ПС);
		Отказ = Истина;
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сообщить(""+Выборка.НомерСтроки + " " + Выборка.Правило);
		КонецЦикла;
	КонецЕсли;	
	
	// Проверим наличие документов за тот же период с той же организацией и ЦФО
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_ОтражениеКосвенныхЗатратПоПроектам.Ссылка
	|ИЗ
	|	Документ.абс_ОтражениеКосвенныхЗатратПоПроектам КАК абс_ОтражениеКосвенныхЗатратПоПроектам
	|ГДЕ
	|	абс_ОтражениеКосвенныхЗатратПоПроектам.Ссылка <> &Ссылка
	|	И абс_ОтражениеКосвенныхЗатратПоПроектам.Организация = &Организация
	|	И абс_ОтражениеКосвенныхЗатратПоПроектам.ЦФО = &ЦФО
	|	И НАЧАЛОПЕРИОДА(абс_ОтражениеКосвенныхЗатратПоПроектам.Дата, МЕСЯЦ) = &Дата";
	
	ЗАпрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ЦФО", ЦФО);
	Запрос.УстановитьПараметр("Дата", НачалоМесяца(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Сообщить("Существует документ(ы), введенные в том же периоде по таким же Организации и ЦФО, что и текущий документ!", СтатусСообщения.Внимание);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДвижения() Экспорт
	
	УдалитьДвижения();
	СтруктураДвижений = СформироватьСтруктуруДвижений();

	Для каждого СтрПравило из ПравилаЗакрытия Цикл
		Попытка
			Справочники.абс_ПравилаЗакрытияСчетов.СформироватьПроводки(СтрПравило.Правило, СтруктураДвижений);		

		Исключение
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Ошибка в правиле "+СтрПравило.Правило+": 
			| "+ОписаниеОшибки());

		КонецПопытки;
	КонецЦикла;
	
	Для каждого ЭлСтруктуры из СтруктураДвижений Цикл
		Если ЭлСтруктуры.Ключ = "Период" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлСтруктуры.Ключ = "Организация" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлСтруктуры.Ключ = "ПараметрыДокументаДляЗапроса" Тогда
			Продолжить;
		КонецЕсли;
		
		Движения[ЭлСтруктуры.Ключ].Загрузить(ЭлСтруктуры.Значение);
	КонецЦикла;
	
	
КонецПроцедуры

Процедура УдалитьДвижения()
	
	Движения.ОборотыБюджетов.Прочитать();
	
	Количество = Движения.ОборотыБюджетов.Количество();

	Если Количество > 0 Тогда
        Движения.ОборотыБюджетов.Очистить();
		Движения.ОборотыБюджетов.Записать();
    КонецЕсли;
    	
КонецПроцедуры

Функция СформироватьСтруктуруДвижений() Экспорт
	
	СтруктураДвижений = Новый Структура;
	Для каждого Движение Из Метаданные().Движения Цикл
		Движения[Движение.Имя].Очистить();
		СтруктураДвижений.Вставить(Движение.Имя, Движения[Движение.Имя].Выгрузить());
	КонецЦикла;
	
	СтруктураДвижений.Вставить("Период", КонецМесяца(Дата));
	СтруктураДвижений.Вставить("Организация",Организация);
	
	ТаблицаПараметров = Новый ТаблицаЗначений;
	ТаблицаПараметров.Колонки.Добавить("НазваниеПараметра");
	ТаблицаПараметров.Колонки.Добавить("Параметр");
	
	НоваяСтрока = ТаблицаПараметров.Добавить();
	НоваяСтрока.НазваниеПараметра = "ЦФО";
	НоваяСтрока.Параметр = ЦФО;
	
	НоваяСтрока = ТаблицаПараметров.Добавить();
	НоваяСтрока.НазваниеПараметра = "ЦФУ";
	НоваяСтрока.Параметр = ЦФУ;
	
	НоваяСтрока = ТаблицаПараметров.Добавить();
	НоваяСтрока.НазваниеПараметра = "ОтборПоЦФО";
	НоваяСтрока.Параметр = ЗначениеЗаполнено(ЦФО);
	
	НоваяСтрока = ТаблицаПараметров.Добавить();
	НоваяСтрока.НазваниеПараметра = "ОтборПоЦФУ";
	НоваяСтрока.Параметр = ЗначениеЗаполнено(ЦФУ);
	
	НоваяСтрока = ТаблицаПараметров.Добавить();
	НоваяСтрока.НазваниеПараметра = "Сценарий";
	НоваяСтрока.Параметр = абс_Бюджетирование.ПолучитьСтруктуСценариевПоОрганизации(Организация).СценарийФакт;
	
	СтруктураДвижений.Вставить("ПараметрыДокументаДляЗапроса", ТаблицаПараметров);
		
	Возврат СтруктураДвижений;
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоНовый() И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления") <> ПометкаУдаления Тогда
		УстановитьАктивностьДвижений(НЕ ПометкаУдаления);
	ИначеЕсли ПометкаУдаления Тогда
		//запись помеченного на удаление документа с активными записями
		УстановитьАктивностьДвижений(Ложь);
	КонецЕсли;

КонецПроцедуры

// Процедура устанавливает/снимает признак активности движений документа
//
Процедура УстановитьАктивностьДвижений(ФлагАктивности)
	
	Для Каждого Движение Из Движения Цикл   
		Движение.Прочитать();
		Для Каждого Строка Из Движение Цикл
			Строка.Активность = ФлагАктивности;
		КонецЦикла;
		Движение.Записать();
	КонецЦикла;
	
КонецПроцедуры // УстановитьАктивностьДвижений()
